const linksArray = [
  {
    href: "#watch",
    text: "Что можно смотреть?",
  },
  {
    href: "#begin",
    text: "Как смотреть вместе?",
  },
  {
    href: "#faq",
    text: "Ответы на вопросы",
  },
];

const categoriesArray = [
  {
    title: "Видео",
    text: "Испытайте удовольствие от просмотра видео на нашем сайте. Откройте для себя новые и захватывающие истории, наслаждайтесь моментами вместе с друзьями!",
  },
  {
    title: "Фильмы",
    text: "Откройте мир кино на нашем сайте: широкий выбор фильмов разных жанров ждет вас! Наслаждайтесь захватывающими историями и уникальными приключениями вместе",
  },
];

const stepsArray = [
  {
    text: "1 шаг",
  },
  {
    text: "2 шаг",
  },
  {
    text: "3 шаг",
  },
  {
    text: "4 шаг",
  },
];

const faqArray = [
  {
    question: "Как работает функция совместного просмотра на вашем сайте?",
    answer:
      "Наша платформа позволяет пользователям создавать комнаты, где они могут пригласить друзей для совместного просмотра фильмов или видео. Как только комната создана, пользователи могут одновременно просматривать контент в реальном времени, общаться через чат или голосовые сообщения, делиться впечатлениями и управлять воспроизведением",
  },
  {
    question: "Как я могу создать комнату для просмотра с друзьями?",
    answer:
      "Для создания комнаты войдите на нашем сайте, выберите соответствующую опцию и следуйте инструкциям. Вы получите уникальную ссылку на комнату, которую можете поделиться со своими друзьями для их присоединения",
  },
  {
    question: "Какие устройства поддерживаются для совместного просмотра?",
    answer:
      "Мы поддерживаем большинство современных устройств, включая компьютеры, ноутбуки, планшеты и смартфоны. Для оптимального использования рекомендуется обновлять браузер до последней версии",
  },
  {
    question:
      "Могу ли я просматривать контент с друзьями, если у нас разные временные зоны?",
    answer:
      "Да, наш сервис позволяет пользователям из разных временных зон совместно просматривать контент. Вы можете выбирать удобное для всех время начала просмотра",
  },
  {
    question:
      "Есть ли ограничения на типы контента, которые можно просматривать вместе с друзьями?",
    answer:
      "Мы поддерживаем широкий спектр контента, включая фильмы, сериалы, видео с YouTube и других популярных платформ. Некоторые контенты могут быть ограничены авторскими правами",
  },
  {
    question:
      "Могу ли я показывать свой собственный контент в комнате для просмотра?",
    answer:
      "Да, наш сервис поддерживает возможность загрузки собственного контента или использование собственных видео для совместного просмотра с друзьями",
  },
  {
    question:
      "Как обеспечивается конфиденциальность данных при использовании вашей платформы?",
    answer:
      "Мы придерживаемся строгих политик конфиденциальности и обеспечиваем защиту личной информации наших пользователей. Мы не раскрываем персональные данные третьим лицам без согласия пользователя",
  },
];

const serviceArray = [
  {
    title: "Описание сервиса",
    text: "Для лучшего понимания",
  },
  {
    title: "Ценности и миссии",
    text: "Связь через совместный контент",
  },
  {
    title: "Функциональные особенности",
    text: "Используйте все функции на максимум",
  },
  {
    title: "Политика конфиденциальности",
    text: "Защита личной информации пользователей",
  },
  {
    title: "Контактная информация",
    text: "Обратная связь и контакты",
  },
  {
    title: "Отзывы и рекомендации",
    text: "Рекомендации и советы пользователей",
  },
];

export { linksArray, categoriesArray, stepsArray, faqArray, serviceArray };
