const linksArray = [
  {
    href: "#watch",
    text: "Что можно смотреть?",
  },
  {
    href: "#begin",
    text: "Как смотреть вместе?",
  },
  {
    href: "#faq",
    text: "Ответы на вопросы",
  },
];

const categoriesArray = [
  {
    title: "Видео",
    text: "Испытайте удовольствие от просмотра видео на нашем сайте. Откройте для себя новые и захватывающие истории, наслаждайтесь моментами вместе с друзьями!",
  },
  {
    title: "Фильмы",
    text: "Откройте мир кино на нашем сайте: широкий выбор фильмов разных жанров ждет вас! Наслаждайтесь захватывающими историями и уникальными приключениями вместе",
  },
];

const stepsArray = [
  {
    text: "1 шаг",
  },
  {
    text: "2 шаг",
  },
  {
    text: "3 шаг",
  },
  {
    text: "4 шаг",
  },
];

const faqArray = [
  {
    question: "Как работает функция совместного просмотра на вашем сайте?",
    answer:
      "Наша платформа позволяет пользователям создавать комнаты, где они могут пригласить друзей для совместного просмотра фильмов или видео. Как только комната создана, пользователи могут одновременно просматривать контент в реальном времени, общаться через чат или голосовые сообщения, делиться впечатлениями и управлять воспроизведением",
  },
  {
    question: "Как я могу создать комнату для просмотра с друзьями?",
    answer:
      "Для создания комнаты войдите на нашем сайте, выберите соответствующую опцию и следуйте инструкциям. Вы получите уникальную ссылку на комнату, которую можете поделиться со своими друзьями для их присоединения",
  },
  {
    question: "Какие устройства поддерживаются для совместного просмотра?",
    answer:
      "Мы поддерживаем большинство современных устройств, включая компьютеры, ноутбуки, планшеты и смартфоны. Для оптимального использования рекомендуется обновлять браузер до последней версии",
  },
  {
    question:
      "Могу ли я просматривать контент с друзьями, если у нас разные временные зоны?",
    answer:
      "Да, наш сервис позволяет пользователям из разных временных зон совместно просматривать контент. Вы можете выбирать удобное для всех время начала просмотра",
  },
  {
    question:
      "Есть ли ограничения на типы контента, которые можно просматривать вместе с друзьями?",
    answer:
      "Мы поддерживаем широкий спектр контента, включая фильмы, сериалы, видео с YouTube и других популярных платформ. Некоторые контенты могут быть ограничены авторскими правами",
  },
  {
    question:
      "Могу ли я показывать свой собственный контент в комнате для просмотра?",
    answer:
      "Да, наш сервис поддерживает возможность загрузки собственного контента или использование собственных видео для совместного просмотра с друзьями",
  },
  {
    question:
      "Как обеспечивается конфиденциальность данных при использовании вашей платформы?",
    answer:
      "Мы придерживаемся строгих политик конфиденциальности и обеспечиваем защиту личной информации наших пользователей. Мы не раскрываем персональные данные третьим лицам без согласия пользователя",
  },
];

const serviceArray = [
  {
    href: "service",
    title: "Описание сервиса",
    tip: "Для лучшего понимания",
  },
  {
    href: "missions",
    title: "Ценности и миссии",
    tip: "Связь через совместный контент",
  },
  {
    href: "features",
    title: "Функциональные особенности",
    tip: "А что есть?",
  },
  {
    href: "privacy",
    title: "Политика конфиденциальности",
    tip: "Защита личной информации пользователей",
  },
  {
    href: "contacts",
    title: "Контактная информация",
    tip: "Обратная связь и контакты",
  },
  {
    href: "feedback",
    title: "Отзывы и рекомендации",
    tip: "Рекомендации и советы пользователей",
  },
];

// about pages

const aboutService = [
  {
    text: "Мы представляем инновационную платформу, нацеленную на объединение пользователей через возможность совместного просмотра фильмов и видео в реальном времени, даже находясь на разных расстояниях. Наша цель - предоставить уникальное виртуальное пространство, где друзья могут наслаждаться кинематографическими шедеврами, обсуждать и делиться впечатлениями одновременно.",
  },
  {
    text: "Платформа позволяет создавать комнаты для просмотра, где пользователи могут пригласить своих друзей, семью или коллег, чтобы вместе насладиться выбранным видеоконтентом. У нас имеется широкий выбор контента - от разнообразных блокбастеров до независимых произведений и сериалов различных жанров - чтобы удовлетворить разнообразные вкусы и интересы наших пользователей.",
  },
  {
    text: "Удобный интерфейс для выбора контента и возможность чата и обмена сообщениями в реальном времени создают атмосферу общения и близости, даже если друзья находятся в разных уголках мира.",
  },
  {
    text: "Одним из наших основных принципов является защита конфиденциальности данных. Мы обеспечиваем безопасность личной информации пользователей, придерживаясь строгих политик безопасности и конфиденциальности.",
  },
  {
    text: "Присоединяйтесь к нам, чтобы создавать незабываемые моменты вместе с друзьями и близкими. Откройте для себя новые возможности для общения и развлечений на уникальной платформе, где совместный просмотр становится не просто активностью, а источником невероятных впечатлений и эмоций.",
  },
];

const missions = [
  {
    title: "Объединение через контент",
    text: "Мы верим в силу общения и связи, которые создаются через совместный просмотр контента. Мы стремимся сблизить людей, предоставляя возможность наслаждаться разнообразным видеоконтентом вместе с близкими",
  },
  {
    title: "Развлечение и близость",
    text: "Мы ценим веселье и удовольствие, которые приносит киносовместный просмотр. Наша платформа наполнена эмоциями и позволяет пользователям наслаждаться общением в реальном времени даже на расстоянии",
  },
  {
    title: "Создание связей",
    text: "Мы признаем значение создания связей между людьми. Наша цель - помочь пользователям ощутить силу общения и укрепить свои отношения через разделяемые кинематографические впечатления",
  },

  {
    title: "Создание уникального опыта",
    text: "Мы стремимся предоставить уникальный опыт совместного просмотра, где каждый пользователь может испытать радость от общения и развлечений вместе с друзьями",
  },
  {
    title: "Доступность и разнообразие",
    text: "Мы уделяем внимание доступности контента и предлагаем широкий спектр видео различных жанров, чтобы удовлетворить интересы всех наших пользователей",
  },
  {
    title: "Безопасность и конфиденциальность",
    text: "Мы обеспечиваем безопасность и защиту личной информации наших пользователей, придерживаясь строгих политик конфиденциальности и безопасности данных",
  },
];

const features = [
  {
    title: "Выбор контента по вкусу",
    text: "Наша платформа предоставляет широкий выбор видео - от популярных фильмов до уникальных сериалов, учитывая разнообразные предпочтения пользователей",
  },
  {
    title: "Чат и обмен впечатлениями",
    text: "Возможность общения в реальном времени во время просмотра создает атмосферу близости, позволяя обмениваться впечатлениями и эмоциями с друзьями",
  },
  {
    title: "Удобный интерфейс",
    text: "Наша платформа разработана с учетом удобства пользователя, обеспечивая простой и интуитивно понятный интерфейс для выбора контента и управления комнатами",
  },
  {
    title: "Поддержка различных устройств",
    text: "Наш сервис доступен на различных устройствах, обеспечивая возможность участвовать в совместном просмотре видео на любом устройстве - от компьютеров до мобильных телефонов",
  },
];

// contact information is here

const privacyPolicy = [
  {
    title: "Политика конфиденциальности",
    text: "Мы придаем большое значение защите вашей личной информации и соблюдаем конфиденциальность данных пользователей нашего сервиса. Наша политика конфиденциальности описывает, как мы собираем, используем, храним и защищаем информацию о наших пользователях",
  },
  {
    title: "Собираемая информация",
    text: "Мы можем собирать различные виды информации при использовании нашего сервиса, включая персональные данные, такие как имя, адрес электронной почты, номер телефона, а также информацию, связанную с вашим использованием нашего сервиса, включая данные о просмотре контента и ваши предпочтения",
  },
  {
    title: "Использование информации",
    text: "Мы используем собранную информацию для предоставления, поддержки, улучшения и развития нашего сервиса. Ваша информация может быть использована для персонализации контента, общения с вами, решения технических проблем, обеспечения безопасности и соблюдения законодательства",
  },
  {
    title: "Защита данных",
    text: "Мы прилагаем все усилия для обеспечения безопасности вашей информации. Мы применяем соответствующие технические, организационные и административные меры для защиты данных от несанкционированного доступа, изменения, раскрытия или уничтожения",
  },
  {
    title: "Раскрытие информации третьим лицам",
    text: "Мы не продаем, не арендуем и не обмениваемся вашей личной информацией с третьими лицами без вашего согласия, за исключением случаев, предусмотренных законодательством или если это необходимо для предоставления вам доступа к услугам",
  },
  {
    title: "Согласие с политикой конфиденциальности",
    text: "Используя наш сервис, вы соглашаетесь с условиями нашей политики конфиденциальности. Пожалуйста, ознакомьтесь с данным документом, чтобы понимать, как мы обрабатываем вашу личную информацию",
  },
  {
    title: "Вопросы?",
    text: "Если у вас есть вопросы или предложения относительно нашей политики конфиденциальности, обращайтесь к нам по указанным контактным данным. Обеспечение вашей конфиденциальности - наш приоритет",
  },
];

// profile

const textArray = [
  {
    text: "Смотрим фнаф",
    href: "#",
  },
  {
    text: "Смотрим фнаф",
    href: "#",
  },
  {
    text: "Смотрим фнаф",
    href: "#",
  },
  {
    text: "Смотрим фнаф",
    href: "#",
  },
  {
    text: "Смотрим фнаф",
    href: "#",
  },
];

const friendsArray = [
  {
    src: "/profile/mnogoznaal.jpg",
    alt: "friend photo",
  },
  {
    src: "/profile/mnogoznaal.jpg",
    alt: "friend photo",
  },
  {
    src: "/profile/mnogoznaal.jpg",
    alt: "friend photo",
  },
  {
    src: "/profile/mnogoznaal.jpg",
    alt: "friend photo",
  },
  {
    src: "/profile/mnogoznaal.jpg",
    alt: "friend photo",
  },
];

const roomFriendsArray = [
  {
    nickname: "Kerak",
  },
  {
    nickname: "PAnanasik",
  },
  {
    nickname: "Jane",
  },
  {
    nickname: "Dedulya",
  },
  {
    nickname: "amogus",
  },
  {
    nickname: "vova",
  },
];

export {
  linksArray,
  categoriesArray,
  stepsArray,
  faqArray,
  serviceArray,
  textArray,
  friendsArray,
  roomFriendsArray,
  aboutService,
  features,
  privacyPolicy,
  missions,
};
